vertical-pod-autoscaler/experiments/sn-pbr-throughput/13minus/home.log
Running 15m test @ http://10.108.33.70:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 5.955ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 6.337ms, rate sampling interval: 18ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.22s    15.75s    0.93m    86.13%
    Req/Sec    29.01     48.99   187.00     87.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.18s 
 75.000%   28.95s 
 90.000%   32.77s 
 99.000%    0.93m 
 99.900%    0.99m 
 99.990%    1.00m 
 99.999%    1.00m 
100.000%    1.00m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.764     0.000000            1         1.00
      64.095     0.100000         5037         1.11
     140.159     0.200000        10069         1.25
     348.927     0.300000        15102         1.43
    3123.199     0.400000        20135         1.67
    9175.039     0.500000        25170         2.00
   14123.007     0.550000        27686         2.22
   20332.543     0.600000        30203         2.50
   27213.823     0.650000        32719         2.86
   28246.015     0.700000        35277         3.33
   28950.527     0.750000        37763         4.00
   29343.743     0.775000        39028         4.44
   29818.879     0.800000        40288         5.00
   30277.631     0.825000        41578         5.71
   30703.615     0.850000        42791         6.67
   31342.591     0.875000        44044         8.00
   31735.807     0.887500        44677         8.89
   32767.999     0.900000        45302        10.00
   35389.439     0.912500        45934        11.43
   37781.503     0.925000        46560        13.33
   40828.927     0.937500        47190        16.00
   42139.647     0.943750        47506        17.78
   43352.063     0.950000        47821        20.00
   46727.167     0.956250        48133        22.86
   48562.175     0.962500        48451        26.67
   50200.575     0.968750        48767        32.00
   50757.631     0.971875        48922        35.56
   51544.063     0.975000        49081        40.00
   52494.335     0.978125        49239        45.71
   53084.159     0.981250        49395        53.33
   53805.055     0.984375        49552        64.00
   54394.879     0.985938        49629        71.11
   55148.543     0.987500        49708        80.00
   55574.527     0.989062        49787        91.43
   55803.903     0.990625        49868       106.67
   56131.583     0.992188        49943       128.00
   56360.959     0.992969        49990       142.22
   56590.335     0.993750        50022       160.00
   57212.927     0.994531        50062       182.86
   57442.303     0.995313        50107       213.33
   57835.519     0.996094        50139       256.00
   58163.199     0.996484        50159       284.44
   58556.415     0.996875        50179       320.00
   58785.791     0.997266        50202       365.71
   58982.399     0.997656        50219       426.67
   59080.703     0.998047        50238       512.00
   59179.007     0.998242        50248       568.89
   59211.775     0.998437        50257       640.00
   59310.079     0.998633        50272       731.43
   59375.615     0.998828        50277       853.33
   59441.151     0.999023        50286      1024.00
   59473.919     0.999121        50291      1137.78
   59539.455     0.999219        50297      1280.00
   59572.223     0.999316        50301      1462.86
   59637.759     0.999414        50309      1706.67
   59670.527     0.999512        50318      2048.00
   59670.527     0.999561        50318      2275.56
   59670.527     0.999609        50318      2560.00
   59670.527     0.999658        50318      2925.71
   59703.295     0.999707        50322      3413.33
   59736.063     0.999756        50326      4096.00
   59736.063     0.999780        50326      4551.11
   59736.063     0.999805        50326      5120.00
   59768.831     0.999829        50328      5851.43
   59768.831     0.999854        50328      6826.67
   59801.599     0.999878        50331      8192.00
   59801.599     0.999890        50331      9102.22
   59801.599     0.999902        50331     10240.00
   59801.599     0.999915        50331     11702.86
   59834.367     0.999927        50332     13653.33
   59834.367     0.999939        50332     16384.00
   59867.135     0.999945        50334     18204.44
   59867.135     0.999951        50334     20480.00
   59867.135     0.999957        50334     23405.71
   59867.135     0.999963        50334     27306.67
   59867.135     0.999969        50334     32768.00
   59867.135     0.999973        50334     36408.89
   59867.135     0.999976        50334     40960.00
   59867.135     0.999979        50334     46811.43
   59899.903     0.999982        50335     54613.33
   59899.903     1.000000        50335          inf
#[Mean    =    15219.422, StdDeviation   =    15752.773]
#[Max     =    59867.136, Total count    =        50335]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  50989 requests in 15.00m, 435.89MB read
  Socket errors: connect 0, read 0, write 11, timeout 0
Requests/sec:     56.65
Transfer/sec:    495.94KB