vertical-pod-autoscaler/experiments/sn-pbr-throughput/13minus/user.log
Running 15m test @ http://10.108.33.70:8080/wrk2-api/post/compose
  2 threads and 4 connections
  Thread calibration: mean lat.: 40.326ms, rate sampling interval: 117ms
  Thread calibration: mean lat.: 37.801ms, rate sampling interval: 104ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   577.12ms  601.61ms   3.13s    91.89%
    Req/Sec    14.57      8.86    38.00     74.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  449.02ms
 75.000%  677.38ms
 90.000%    1.06s 
 99.000%    3.13s 
 99.900%    6.22s 
 99.990%    6.74s 
 99.999%    6.84s 
100.000%    6.84s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.899     0.000000            1         1.00
     117.695     0.100000         2653         1.11
     217.471     0.200000         5303         1.25
     309.759     0.300000         7958         1.43
     380.671     0.400000        10615         1.67
     449.023     0.500000        13260         2.00
     485.119     0.550000        14590         2.22
     523.775     0.600000        15915         2.50
     566.271     0.650000        17240         2.86
     616.447     0.700000        18570         3.33
     677.375     0.750000        19886         4.00
     713.727     0.775000        20559         4.44
     754.687     0.800000        21213         5.00
     801.791     0.825000        21878         5.71
     862.207     0.850000        22540         6.67
     939.007     0.875000        23200         8.00
     994.815     0.887500        23534         8.89
    1055.743     0.900000        23865        10.00
    1129.471     0.912500        24197        11.43
    1230.847     0.925000        24530        13.33
    1339.391     0.937500        24857        16.00
    1411.071     0.943750        25026        17.78
    1504.255     0.950000        25190        20.00
    1618.943     0.956250        25355        22.86
    1744.895     0.962500        25520        26.67
    1907.711     0.968750        25686        32.00
    1983.487     0.971875        25770        35.56
    2088.959     0.975000        25852        40.00
    2201.599     0.978125        25936        45.71
    2375.679     0.981250        26021        53.33
    2603.007     0.984375        26100        64.00
    2723.839     0.985938        26142        71.11
    2869.247     0.987500        26183        80.00
    3012.607     0.989062        26225        91.43
    3289.087     0.990625        26266       106.67
    3647.487     0.992188        26307       128.00
    3815.423     0.992969        26328       142.22
    3960.831     0.993750        26349       160.00
    4175.871     0.994531        26370       182.86
    4292.607     0.995313        26391       213.33
    4497.407     0.996094        26411       256.00
    4763.647     0.996484        26421       284.44
    5488.639     0.996875        26432       320.00
    5623.807     0.997266        26444       365.71
    5689.343     0.997656        26452       426.67
    5894.143     0.998047        26463       512.00
    5992.447     0.998242        26468       568.89
    6103.039     0.998437        26473       640.00
    6143.999     0.998633        26478       731.43
    6184.959     0.998828        26483       853.33
    6230.015     0.999023        26489      1024.00
    6250.495     0.999121        26491      1137.78
    6299.647     0.999219        26495      1280.00
    6303.743     0.999316        26497      1462.86
    6348.799     0.999414        26499      1706.67
    6385.663     0.999512        26502      2048.00
    6389.759     0.999561        26503      2275.56
    6406.143     0.999609        26504      2560.00
    6422.527     0.999658        26505      2925.71
    6598.655     0.999707        26507      3413.33
    6627.327     0.999756        26508      4096.00
    6713.343     0.999780        26509      4551.11
    6713.343     0.999805        26509      5120.00
    6729.727     0.999829        26510      5851.43
    6737.919     0.999854        26512      6826.67
    6737.919     0.999878        26512      8192.00
    6737.919     0.999890        26512      9102.22
    6737.919     0.999902        26512     10240.00
    6737.919     0.999915        26512     11702.86
    6832.127     0.999927        26513     13653.33
    6832.127     0.999939        26513     16384.00
    6832.127     0.999945        26513     18204.44
    6832.127     0.999951        26513     20480.00
    6832.127     0.999957        26513     23405.71
    6836.223     0.999963        26514     27306.67
    6836.223     1.000000        26514          inf
#[Mean    =      577.117, StdDeviation   =      601.607]
#[Max     =     6832.128, Total count    =        26514]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26840 requests in 15.00m, 350.54MB read
  Socket errors: connect 0, read 0, write 8, timeout 0
Requests/sec:     29.82
Transfer/sec:    398.79KB